mod3-project-gratitude-journal/app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
    def index
        render json: Chat.all

INSERT INTO "chats" ("message", "created_at", "updated_at") VALUES (?, ?, ?)  [["message", "YEE"], ["created_at", "2019-04-19 13:44:43.069313"], ["updated_at", "2019-04-19 13:44:43.069313"]]
---
    def create
        chat = Chat.create(chat_params)