mod3-project-gratitude-journal/app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
    def index
        render json: Entry.all,
        include: {journal: {except: [:id, :created_at, :updated_at] }}

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: Entry.find(params[:id])

INSERT INTO "entries" ("input1", "input2", "input3", "journal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["input1", "test"], ["input2", "test"], ["input3", "test"], ["journal_id", 2], ["created_at", "2019-04-17 23:11:48.047449"], ["updated_at", "2019-04-17 23:11:48.047449"]]
---
    def create
        entry = Entry.create(entry_params)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 11]]
---
    def destroy
        entry = Entry.find(params[:id])
        unless entry.nil?
            entry.destroy